cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'tmux'
brew 'awscli'
brew 'htop'
brew 'nvm'
brew 'yarn'
brew 'git'
brew 'openssl'
brew 'unar'
brew 'gpg'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'stern'
brew 'terraform'
brew 'gh'
brew 'helm'
brew 'gpg'
brew 'pinentry-mac'
brew 'wireguard-tools'
brew 'jq'
brew 'watch'

cask 'visual-studio-code'
cask 'google-cloud-sdk'
cask 'discord'
brew 'kubectl'
brew 'ansible'
cask 'omnidisksweeper'
cask 'calibre'
cask 'telegram'
cask 'keybase'
cask 'postman'
cask 'vlc'
cask 'spectacle'
cask 'figma'
cask 'tradingview'
cask 'nordvpn'
cask 'transmission'
cask 'tunnelblick'
cask 'vnc-viewer'