cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'tmux'
brew 'awscli'
brew 'htop'
brew 'nvm'
brew 'yarn'
brew 'git'
brew 'openssl'
# brew 'unrar'
brew 'gpg'
brew 'zsh-syntax-highlighting'
brew 'stern'
brew 'terraform'

cask 'iterm2'
cask 'visual-studio-code'
cask 'slack'
cask 'recordit'

# Required privileges access
# cask 'virtualbox
# cask 'virtualbox-extension-pack

# Others
cask 'private-internet-access'
cask 'google-cloud-sdk'
cask 'discord'
brew 'platformio'
brew 'kubernetes-cli'
brew 'youtube-dl'
brew 'ansible'
cask 'omnidisksweeper'
cask 'calibre'
cask 'telegram'
cask 'keybase'
cask 'postman'
cask 'vlc'
cask 'spectacle'
