cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'tmux'
brew 'ansible'
brew 'awscli'
brew 'htop'
brew 'kubernetes-cli'
brew 'youtube-dl'
brew 'nvm'
brew 'yarn'
brew 'git'
brew 'openssl'
brew 'unrar'
brew 'gpg'
brew 'platformio'

# install applications
cask 'docker'
cask 'iterm2'
cask 'sublime-text'
cask 'vagrant'
cask 'visual-studio-code'

#Note: Required privileges access
#cask 'virtualbox
#cask 'virtualbox-extension-pack

cask 'alfred'
cask '1password'
cask 'cyberduck'
#cask 'little-snitch'
#cask 'cleanmymac'
#cask 'google-chrome'
cask 'tunnelbear'
cask 'postman'

# applications that are not immediately needed
cask 'dropbox'
cask 'skype'
cask 'vlc'
cask 'spectacle'
cask 'tower'
cask 'keybase'
cask 'calibre'
cask 'telegram'
cask 'macdown'
cask 'slack'
cask 'omnidisksweeper'
cask 'etcher'
cask 'discord'
